{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Exercício - Grafo contendo filmes, atores e diretores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Carregando extensão para Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Limpando o banco de dados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "253 relationship deleted.\n",
      "171 nodes deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher MATCH (n)-[r]-() DELETE r\n",
    "%cypher MATCH (n) DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Importando grafo contendo filmes, atores e diretores (execute apenas uma vez)\n",
    "\n",
    "A célula abaixo contém todas as consultas necessárias para a contrução do grafo que será utilizado neste exercício. (após a linha `%%cypher`)\n",
    "\n",
    "Você pode copiar e colar as consultas no [Neo4j Sandbox](https://sandbox.neo4j.com/login) para reconstruir o grafo. A partir daí, você poderá fazer as suas consultas de maneira mais visual na interface do próprio Neo4j. Lembre-se de colar a consulta no notebook que será entregue\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "171 nodes created.\n",
      "564 properties set.\n",
      "253 relationships created.\n",
      "171 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "\n",
    "CREATE (TheMatrix:Movie {title:'The Matrix', released:1999, tagline:'Welcome to the Real World'})\n",
    "CREATE (Keanu:Person {name:'Keanu Reeves', born:1964})\n",
    "CREATE (Carrie:Person {name:'Carrie-Anne Moss', born:1967})\n",
    "CREATE (Laurence:Person {name:'Laurence Fishburne', born:1961})\n",
    "CREATE (Hugo:Person {name:'Hugo Weaving', born:1960})\n",
    "CREATE (LillyW:Person {name:'Lilly Wachowski', born:1967})\n",
    "CREATE (LanaW:Person {name:'Lana Wachowski', born:1965})\n",
    "CREATE (JoelS:Person {name:'Joel Silver', born:1952})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrix),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrix),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrix),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrix),\n",
    "  (LillyW)-[:DIRECTED]->(TheMatrix),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrix),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrix)\n",
    "\n",
    "CREATE (Emil:Person {name:\"Emil Eifrem\", born:1978})\n",
    "CREATE (Emil)-[:ACTED_IN {roles:[\"Emil\"]}]->(TheMatrix)\n",
    "\n",
    "CREATE (TheMatrixReloaded:Movie {title:'The Matrix Reloaded', released:2003, tagline:'Free your mind'})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrixReloaded),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrixReloaded),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrixReloaded),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrixReloaded),\n",
    "  (LillyW)-[:DIRECTED]->(TheMatrixReloaded),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrixReloaded),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrixReloaded)\n",
    "\n",
    "CREATE (TheMatrixRevolutions:Movie {title:'The Matrix Revolutions', released:2003, tagline:'Everything that has a beginning has an end'})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrixRevolutions),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrixRevolutions),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrixRevolutions),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrixRevolutions),\n",
    "  (LillyW)-[:DIRECTED]->(TheMatrixRevolutions),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrixRevolutions),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrixRevolutions)\n",
    "\n",
    "CREATE (TheDevilsAdvocate:Movie {title:\"The Devil's Advocate\", released:1997, tagline:'Evil has its winning ways'})\n",
    "CREATE (Charlize:Person {name:'Charlize Theron', born:1975})\n",
    "CREATE (Al:Person {name:'Al Pacino', born:1940})\n",
    "CREATE (Taylor:Person {name:'Taylor Hackford', born:1944})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Kevin Lomax']}]->(TheDevilsAdvocate),\n",
    "  (Charlize)-[:ACTED_IN {roles:['Mary Ann Lomax']}]->(TheDevilsAdvocate),\n",
    "  (Al)-[:ACTED_IN {roles:['John Milton']}]->(TheDevilsAdvocate),\n",
    "  (Taylor)-[:DIRECTED]->(TheDevilsAdvocate)\n",
    "\n",
    "CREATE (AFewGoodMen:Movie {title:\"A Few Good Men\", released:1992, tagline:\"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\"})\n",
    "CREATE (TomC:Person {name:'Tom Cruise', born:1962})\n",
    "CREATE (JackN:Person {name:'Jack Nicholson', born:1937})\n",
    "CREATE (DemiM:Person {name:'Demi Moore', born:1962})\n",
    "CREATE (KevinB:Person {name:'Kevin Bacon', born:1958})\n",
    "CREATE (KieferS:Person {name:'Kiefer Sutherland', born:1966})\n",
    "CREATE (NoahW:Person {name:'Noah Wyle', born:1971})\n",
    "CREATE (CubaG:Person {name:'Cuba Gooding Jr.', born:1968})\n",
    "CREATE (KevinP:Person {name:'Kevin Pollak', born:1957})\n",
    "CREATE (JTW:Person {name:'J.T. Walsh', born:1943})\n",
    "CREATE (JamesM:Person {name:'James Marshall', born:1967})\n",
    "CREATE (ChristopherG:Person {name:'Christopher Guest', born:1948})\n",
    "CREATE (RobR:Person {name:'Rob Reiner', born:1947})\n",
    "CREATE (AaronS:Person {name:'Aaron Sorkin', born:1961})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Lt. Daniel Kaffee']}]->(AFewGoodMen),\n",
    "  (JackN)-[:ACTED_IN {roles:['Col. Nathan R. Jessup']}]->(AFewGoodMen),\n",
    "  (DemiM)-[:ACTED_IN {roles:['Lt. Cdr. JoAnne Galloway']}]->(AFewGoodMen),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Capt. Jack Ross']}]->(AFewGoodMen),\n",
    "  (KieferS)-[:ACTED_IN {roles:['Lt. Jonathan Kendrick']}]->(AFewGoodMen),\n",
    "  (NoahW)-[:ACTED_IN {roles:['Cpl. Jeffrey Barnes']}]->(AFewGoodMen),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Cpl. Carl Hammaker']}]->(AFewGoodMen),\n",
    "  (KevinP)-[:ACTED_IN {roles:['Lt. Sam Weinberg']}]->(AFewGoodMen),\n",
    "  (JTW)-[:ACTED_IN {roles:['Lt. Col. Matthew Andrew Markinson']}]->(AFewGoodMen),\n",
    "  (JamesM)-[:ACTED_IN {roles:['Pfc. Louden Downey']}]->(AFewGoodMen),\n",
    "  (ChristopherG)-[:ACTED_IN {roles:['Dr. Stone']}]->(AFewGoodMen),\n",
    "  (AaronS)-[:ACTED_IN {roles:['Man in Bar']}]->(AFewGoodMen),\n",
    "  (RobR)-[:DIRECTED]->(AFewGoodMen),\n",
    "  (AaronS)-[:WROTE]->(AFewGoodMen)\n",
    "\n",
    "CREATE (TopGun:Movie {title:\"Top Gun\", released:1986, tagline:'I feel the need, the need for speed.'})\n",
    "CREATE (KellyM:Person {name:'Kelly McGillis', born:1957})\n",
    "CREATE (ValK:Person {name:'Val Kilmer', born:1959})\n",
    "CREATE (AnthonyE:Person {name:'Anthony Edwards', born:1962})\n",
    "CREATE (TomS:Person {name:'Tom Skerritt', born:1933})\n",
    "CREATE (MegR:Person {name:'Meg Ryan', born:1961})\n",
    "CREATE (TonyS:Person {name:'Tony Scott', born:1944})\n",
    "CREATE (JimC:Person {name:'Jim Cash', born:1941})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Maverick']}]->(TopGun),\n",
    "  (KellyM)-[:ACTED_IN {roles:['Charlie']}]->(TopGun),\n",
    "  (ValK)-[:ACTED_IN {roles:['Iceman']}]->(TopGun),\n",
    "  (AnthonyE)-[:ACTED_IN {roles:['Goose']}]->(TopGun),\n",
    "  (TomS)-[:ACTED_IN {roles:['Viper']}]->(TopGun),\n",
    "  (MegR)-[:ACTED_IN {roles:['Carole']}]->(TopGun),\n",
    "  (TonyS)-[:DIRECTED]->(TopGun),\n",
    "  (JimC)-[:WROTE]->(TopGun)\n",
    "\n",
    "CREATE (JerryMaguire:Movie {title:'Jerry Maguire', released:2000, tagline:'The rest of his life begins now.'})\n",
    "CREATE (ReneeZ:Person {name:'Renee Zellweger', born:1969})\n",
    "CREATE (KellyP:Person {name:'Kelly Preston', born:1962})\n",
    "CREATE (JerryO:Person {name:\"Jerry O'Connell\", born:1974})\n",
    "CREATE (JayM:Person {name:'Jay Mohr', born:1970})\n",
    "CREATE (BonnieH:Person {name:'Bonnie Hunt', born:1961})\n",
    "CREATE (ReginaK:Person {name:'Regina King', born:1971})\n",
    "CREATE (JonathanL:Person {name:'Jonathan Lipnicki', born:1996})\n",
    "CREATE (CameronC:Person {name:'Cameron Crowe', born:1957})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Jerry Maguire']}]->(JerryMaguire),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Rod Tidwell']}]->(JerryMaguire),\n",
    "  (ReneeZ)-[:ACTED_IN {roles:['Dorothy Boyd']}]->(JerryMaguire),\n",
    "  (KellyP)-[:ACTED_IN {roles:['Avery Bishop']}]->(JerryMaguire),\n",
    "  (JerryO)-[:ACTED_IN {roles:['Frank Cushman']}]->(JerryMaguire),\n",
    "  (JayM)-[:ACTED_IN {roles:['Bob Sugar']}]->(JerryMaguire),\n",
    "  (BonnieH)-[:ACTED_IN {roles:['Laurel Boyd']}]->(JerryMaguire),\n",
    "  (ReginaK)-[:ACTED_IN {roles:['Marcee Tidwell']}]->(JerryMaguire),\n",
    "  (JonathanL)-[:ACTED_IN {roles:['Ray Boyd']}]->(JerryMaguire),\n",
    "  (CameronC)-[:DIRECTED]->(JerryMaguire),\n",
    "  (CameronC)-[:PRODUCED]->(JerryMaguire),\n",
    "  (CameronC)-[:WROTE]->(JerryMaguire)\n",
    "\n",
    "CREATE (StandByMe:Movie {title:\"Stand By Me\", released:1986, tagline:\"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\"})\n",
    "CREATE (RiverP:Person {name:'River Phoenix', born:1970})\n",
    "CREATE (CoreyF:Person {name:'Corey Feldman', born:1971})\n",
    "CREATE (WilW:Person {name:'Wil Wheaton', born:1972})\n",
    "CREATE (JohnC:Person {name:'John Cusack', born:1966})\n",
    "CREATE (MarshallB:Person {name:'Marshall Bell', born:1942})\n",
    "CREATE\n",
    "  (WilW)-[:ACTED_IN {roles:['Gordie Lachance']}]->(StandByMe),\n",
    "  (RiverP)-[:ACTED_IN {roles:['Chris Chambers']}]->(StandByMe),\n",
    "  (JerryO)-[:ACTED_IN {roles:['Vern Tessio']}]->(StandByMe),\n",
    "  (CoreyF)-[:ACTED_IN {roles:['Teddy Duchamp']}]->(StandByMe),\n",
    "  (JohnC)-[:ACTED_IN {roles:['Denny Lachance']}]->(StandByMe),\n",
    "  (KieferS)-[:ACTED_IN {roles:['Ace Merrill']}]->(StandByMe),\n",
    "  (MarshallB)-[:ACTED_IN {roles:['Mr. Lachance']}]->(StandByMe),\n",
    "  (RobR)-[:DIRECTED]->(StandByMe)\n",
    "\n",
    "CREATE (AsGoodAsItGets:Movie {title:'As Good as It Gets', released:1997, tagline:'A comedy from the heart that goes for the throat.'})\n",
    "CREATE (HelenH:Person {name:'Helen Hunt', born:1963})\n",
    "CREATE (GregK:Person {name:'Greg Kinnear', born:1963})\n",
    "CREATE (JamesB:Person {name:'James L. Brooks', born:1940})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Melvin Udall']}]->(AsGoodAsItGets),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Carol Connelly']}]->(AsGoodAsItGets),\n",
    "  (GregK)-[:ACTED_IN {roles:['Simon Bishop']}]->(AsGoodAsItGets),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Frank Sachs']}]->(AsGoodAsItGets),\n",
    "  (JamesB)-[:DIRECTED]->(AsGoodAsItGets)\n",
    "\n",
    "CREATE (WhatDreamsMayCome:Movie {title:'What Dreams May Come', released:1998, tagline:'After life there is more. The end is just the beginning.'})\n",
    "CREATE (AnnabellaS:Person {name:'Annabella Sciorra', born:1960})\n",
    "CREATE (MaxS:Person {name:'Max von Sydow', born:1929})\n",
    "CREATE (WernerH:Person {name:'Werner Herzog', born:1942})\n",
    "CREATE (Robin:Person {name:'Robin Williams', born:1951})\n",
    "CREATE (VincentW:Person {name:'Vincent Ward', born:1956})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Chris Nielsen']}]->(WhatDreamsMayCome),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Albert Lewis']}]->(WhatDreamsMayCome),\n",
    "  (AnnabellaS)-[:ACTED_IN {roles:['Annie Collins-Nielsen']}]->(WhatDreamsMayCome),\n",
    "  (MaxS)-[:ACTED_IN {roles:['The Tracker']}]->(WhatDreamsMayCome),\n",
    "  (WernerH)-[:ACTED_IN {roles:['The Face']}]->(WhatDreamsMayCome),\n",
    "  (VincentW)-[:DIRECTED]->(WhatDreamsMayCome)\n",
    "\n",
    "CREATE (SnowFallingonCedars:Movie {title:'Snow Falling on Cedars', released:1999, tagline:'First loves last. Forever.'})\n",
    "CREATE (EthanH:Person {name:'Ethan Hawke', born:1970})\n",
    "CREATE (RickY:Person {name:'Rick Yune', born:1971})\n",
    "CREATE (JamesC:Person {name:'James Cromwell', born:1940})\n",
    "CREATE (ScottH:Person {name:'Scott Hicks', born:1953})\n",
    "CREATE\n",
    "  (EthanH)-[:ACTED_IN {roles:['Ishmael Chambers']}]->(SnowFallingonCedars),\n",
    "  (RickY)-[:ACTED_IN {roles:['Kazuo Miyamoto']}]->(SnowFallingonCedars),\n",
    "  (MaxS)-[:ACTED_IN {roles:['Nels Gudmundsson']}]->(SnowFallingonCedars),\n",
    "  (JamesC)-[:ACTED_IN {roles:['Judge Fielding']}]->(SnowFallingonCedars),\n",
    "  (ScottH)-[:DIRECTED]->(SnowFallingonCedars)\n",
    "\n",
    "CREATE (YouveGotMail:Movie {title:\"You've Got Mail\", released:1998, tagline:'At odds in life... in love on-line.'})\n",
    "CREATE (ParkerP:Person {name:'Parker Posey', born:1968})\n",
    "CREATE (DaveC:Person {name:'Dave Chappelle', born:1973})\n",
    "CREATE (SteveZ:Person {name:'Steve Zahn', born:1967})\n",
    "CREATE (TomH:Person {name:'Tom Hanks', born:1956})\n",
    "CREATE (NoraE:Person {name:'Nora Ephron', born:1941})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Joe Fox']}]->(YouveGotMail),\n",
    "  (MegR)-[:ACTED_IN {roles:['Kathleen Kelly']}]->(YouveGotMail),\n",
    "  (GregK)-[:ACTED_IN {roles:['Frank Navasky']}]->(YouveGotMail),\n",
    "  (ParkerP)-[:ACTED_IN {roles:['Patricia Eden']}]->(YouveGotMail),\n",
    "  (DaveC)-[:ACTED_IN {roles:['Kevin Jackson']}]->(YouveGotMail),\n",
    "  (SteveZ)-[:ACTED_IN {roles:['George Pappas']}]->(YouveGotMail),\n",
    "  (NoraE)-[:DIRECTED]->(YouveGotMail)\n",
    "\n",
    "CREATE (SleeplessInSeattle:Movie {title:'Sleepless in Seattle', released:1993, tagline:'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?'})\n",
    "CREATE (RitaW:Person {name:'Rita Wilson', born:1956})\n",
    "CREATE (BillPull:Person {name:'Bill Pullman', born:1953})\n",
    "CREATE (VictorG:Person {name:'Victor Garber', born:1949})\n",
    "CREATE (RosieO:Person {name:\"Rosie O'Donnell\", born:1962})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Sam Baldwin']}]->(SleeplessInSeattle),\n",
    "  (MegR)-[:ACTED_IN {roles:['Annie Reed']}]->(SleeplessInSeattle),\n",
    "  (RitaW)-[:ACTED_IN {roles:['Suzy']}]->(SleeplessInSeattle),\n",
    "  (BillPull)-[:ACTED_IN {roles:['Walter']}]->(SleeplessInSeattle),\n",
    "  (VictorG)-[:ACTED_IN {roles:['Greg']}]->(SleeplessInSeattle),\n",
    "  (RosieO)-[:ACTED_IN {roles:['Becky']}]->(SleeplessInSeattle),\n",
    "  (NoraE)-[:DIRECTED]->(SleeplessInSeattle)\n",
    "\n",
    "CREATE (JoeVersustheVolcano:Movie {title:'Joe Versus the Volcano', released:1990, tagline:'A story of love, lava and burning desire.'})\n",
    "CREATE (JohnS:Person {name:'John Patrick Stanley', born:1950})\n",
    "CREATE (Nathan:Person {name:'Nathan Lane', born:1956})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Joe Banks']}]->(JoeVersustheVolcano),\n",
    "  (MegR)-[:ACTED_IN {roles:['DeDe', 'Angelica Graynamore', 'Patricia Graynamore']}]->(JoeVersustheVolcano),\n",
    "  (Nathan)-[:ACTED_IN {roles:['Baw']}]->(JoeVersustheVolcano),\n",
    "  (JohnS)-[:DIRECTED]->(JoeVersustheVolcano)\n",
    "\n",
    "CREATE (WhenHarryMetSally:Movie {title:'When Harry Met Sally', released:1998, tagline:'Can two friends sleep together and still love each other in the morning?'})\n",
    "CREATE (BillyC:Person {name:'Billy Crystal', born:1948})\n",
    "CREATE (CarrieF:Person {name:'Carrie Fisher', born:1956})\n",
    "CREATE (BrunoK:Person {name:'Bruno Kirby', born:1949})\n",
    "CREATE\n",
    "  (BillyC)-[:ACTED_IN {roles:['Harry Burns']}]->(WhenHarryMetSally),\n",
    "  (MegR)-[:ACTED_IN {roles:['Sally Albright']}]->(WhenHarryMetSally),\n",
    "  (CarrieF)-[:ACTED_IN {roles:['Marie']}]->(WhenHarryMetSally),\n",
    "  (BrunoK)-[:ACTED_IN {roles:['Jess']}]->(WhenHarryMetSally),\n",
    "  (RobR)-[:DIRECTED]->(WhenHarryMetSally),\n",
    "  (RobR)-[:PRODUCED]->(WhenHarryMetSally),\n",
    "  (NoraE)-[:PRODUCED]->(WhenHarryMetSally),\n",
    "  (NoraE)-[:WROTE]->(WhenHarryMetSally)\n",
    "\n",
    "CREATE (ThatThingYouDo:Movie {title:'That Thing You Do', released:1996, tagline:'In every life there comes a time when that thing you dream becomes that thing you do'})\n",
    "CREATE (LivT:Person {name:'Liv Tyler', born:1977})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Mr. White']}]->(ThatThingYouDo),\n",
    "  (LivT)-[:ACTED_IN {roles:['Faye Dolan']}]->(ThatThingYouDo),\n",
    "  (Charlize)-[:ACTED_IN {roles:['Tina']}]->(ThatThingYouDo),\n",
    "  (TomH)-[:DIRECTED]->(ThatThingYouDo)\n",
    "\n",
    "CREATE (TheReplacements:Movie {title:'The Replacements', released:2000, tagline:'Pain heals, Chicks dig scars... Glory lasts forever'})\n",
    "CREATE (Brooke:Person {name:'Brooke Langton', born:1970})\n",
    "CREATE (Gene:Person {name:'Gene Hackman', born:1930})\n",
    "CREATE (Orlando:Person {name:'Orlando Jones', born:1968})\n",
    "CREATE (Howard:Person {name:'Howard Deutch', born:1950})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Shane Falco']}]->(TheReplacements),\n",
    "  (Brooke)-[:ACTED_IN {roles:['Annabelle Farrell']}]->(TheReplacements),\n",
    "  (Gene)-[:ACTED_IN {roles:['Jimmy McGinty']}]->(TheReplacements),\n",
    "  (Orlando)-[:ACTED_IN {roles:['Clifford Franklin']}]->(TheReplacements),\n",
    "  (Howard)-[:DIRECTED]->(TheReplacements)\n",
    "\n",
    "CREATE (RescueDawn:Movie {title:'RescueDawn', released:2006, tagline:\"Based on the extraordinary true story of one man's fight for freedom\"})\n",
    "CREATE (ChristianB:Person {name:'Christian Bale', born:1974})\n",
    "CREATE (ZachG:Person {name:'Zach Grenier', born:1954})\n",
    "CREATE\n",
    "  (MarshallB)-[:ACTED_IN {roles:['Admiral']}]->(RescueDawn),\n",
    "  (ChristianB)-[:ACTED_IN {roles:['Dieter Dengler']}]->(RescueDawn),\n",
    "  (ZachG)-[:ACTED_IN {roles:['Squad Leader']}]->(RescueDawn),\n",
    "  (SteveZ)-[:ACTED_IN {roles:['Duane']}]->(RescueDawn),\n",
    "  (WernerH)-[:DIRECTED]->(RescueDawn)\n",
    "\n",
    "CREATE (TheBirdcage:Movie {title:'The Birdcage', released:1996, tagline:'Come as you are'})\n",
    "CREATE (MikeN:Person {name:'Mike Nichols', born:1931})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Armand Goldman']}]->(TheBirdcage),\n",
    "  (Nathan)-[:ACTED_IN {roles:['Albert Goldman']}]->(TheBirdcage),\n",
    "  (Gene)-[:ACTED_IN {roles:['Sen. Kevin Keeley']}]->(TheBirdcage),\n",
    "  (MikeN)-[:DIRECTED]->(TheBirdcage)\n",
    "\n",
    "CREATE (Unforgiven:Movie {title:'Unforgiven', released:1992, tagline:\"It's a hell of a thing, killing a man\"})\n",
    "CREATE (RichardH:Person {name:'Richard Harris', born:1930})\n",
    "CREATE (ClintE:Person {name:'Clint Eastwood', born:1930})\n",
    "CREATE\n",
    "  (RichardH)-[:ACTED_IN {roles:['English Bob']}]->(Unforgiven),\n",
    "  (ClintE)-[:ACTED_IN {roles:['Bill Munny']}]->(Unforgiven),\n",
    "  (Gene)-[:ACTED_IN {roles:['Little Bill Daggett']}]->(Unforgiven),\n",
    "  (ClintE)-[:DIRECTED]->(Unforgiven)\n",
    "\n",
    "CREATE (JohnnyMnemonic:Movie {title:'Johnny Mnemonic', released:1995, tagline:'The hottest data on earth. In the coolest head in town'})\n",
    "CREATE (Takeshi:Person {name:'Takeshi Kitano', born:1947})\n",
    "CREATE (Dina:Person {name:'Dina Meyer', born:1968})\n",
    "CREATE (IceT:Person {name:'Ice-T', born:1958})\n",
    "CREATE (RobertL:Person {name:'Robert Longo', born:1953})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Johnny Mnemonic']}]->(JohnnyMnemonic),\n",
    "  (Takeshi)-[:ACTED_IN {roles:['Takahashi']}]->(JohnnyMnemonic),\n",
    "  (Dina)-[:ACTED_IN {roles:['Jane']}]->(JohnnyMnemonic),\n",
    "  (IceT)-[:ACTED_IN {roles:['J-Bone']}]->(JohnnyMnemonic),\n",
    "  (RobertL)-[:DIRECTED]->(JohnnyMnemonic)\n",
    "\n",
    "CREATE (CloudAtlas:Movie {title:'Cloud Atlas', released:2012, tagline:'Everything is connected'})\n",
    "CREATE (HalleB:Person {name:'Halle Berry', born:1966})\n",
    "CREATE (JimB:Person {name:'Jim Broadbent', born:1949})\n",
    "CREATE (TomT:Person {name:'Tom Tykwer', born:1965})\n",
    "CREATE (DavidMitchell:Person {name:'David Mitchell', born:1969})\n",
    "CREATE (StefanArndt:Person {name:'Stefan Arndt', born:1961})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Zachry', 'Dr. Henry Goose', 'Isaac Sachs', 'Dermot Hoggins']}]->(CloudAtlas),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Bill Smoke', 'Haskell Moore', 'Tadeusz Kesselring', 'Nurse Noakes', 'Boardman Mephi', 'Old Georgie']}]->(CloudAtlas),\n",
    "  (HalleB)-[:ACTED_IN {roles:['Luisa Rey', 'Jocasta Ayrs', 'Ovid', 'Meronym']}]->(CloudAtlas),\n",
    "  (JimB)-[:ACTED_IN {roles:['Vyvyan Ayrs', 'Captain Molyneux', 'Timothy Cavendish']}]->(CloudAtlas),\n",
    "  (TomT)-[:DIRECTED]->(CloudAtlas),\n",
    "  (LillyW)-[:DIRECTED]->(CloudAtlas),\n",
    "  (LanaW)-[:DIRECTED]->(CloudAtlas),\n",
    "  (DavidMitchell)-[:WROTE]->(CloudAtlas),\n",
    "  (StefanArndt)-[:PRODUCED]->(CloudAtlas)\n",
    "\n",
    "CREATE (TheDaVinciCode:Movie {title:'The Da Vinci Code', released:2006, tagline:'Break The Codes'})\n",
    "CREATE (IanM:Person {name:'Ian McKellen', born:1939})\n",
    "CREATE (AudreyT:Person {name:'Audrey Tautou', born:1976})\n",
    "CREATE (PaulB:Person {name:'Paul Bettany', born:1971})\n",
    "CREATE (RonH:Person {name:'Ron Howard', born:1954})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Dr. Robert Langdon']}]->(TheDaVinciCode),\n",
    "  (IanM)-[:ACTED_IN {roles:['Sir Leight Teabing']}]->(TheDaVinciCode),\n",
    "  (AudreyT)-[:ACTED_IN {roles:['Sophie Neveu']}]->(TheDaVinciCode),\n",
    "  (PaulB)-[:ACTED_IN {roles:['Silas']}]->(TheDaVinciCode),\n",
    "  (RonH)-[:DIRECTED]->(TheDaVinciCode)\n",
    "\n",
    "CREATE (VforVendetta:Movie {title:'V for Vendetta', released:2006, tagline:'Freedom! Forever!'})\n",
    "CREATE (NatalieP:Person {name:'Natalie Portman', born:1981})\n",
    "CREATE (StephenR:Person {name:'Stephen Rea', born:1946})\n",
    "CREATE (JohnH:Person {name:'John Hurt', born:1940})\n",
    "CREATE (BenM:Person {name: 'Ben Miles', born:1967})\n",
    "CREATE\n",
    "  (Hugo)-[:ACTED_IN {roles:['V']}]->(VforVendetta),\n",
    "  (NatalieP)-[:ACTED_IN {roles:['Evey Hammond']}]->(VforVendetta),\n",
    "  (StephenR)-[:ACTED_IN {roles:['Eric Finch']}]->(VforVendetta),\n",
    "  (JohnH)-[:ACTED_IN {roles:['High Chancellor Adam Sutler']}]->(VforVendetta),\n",
    "  (BenM)-[:ACTED_IN {roles:['Dascomb']}]->(VforVendetta),\n",
    "  (JamesM)-[:DIRECTED]->(VforVendetta),\n",
    "  (LillyW)-[:PRODUCED]->(VforVendetta),\n",
    "  (LanaW)-[:PRODUCED]->(VforVendetta),\n",
    "  (JoelS)-[:PRODUCED]->(VforVendetta),\n",
    "  (LillyW)-[:WROTE]->(VforVendetta),\n",
    "  (LanaW)-[:WROTE]->(VforVendetta)\n",
    "\n",
    "CREATE (SpeedRacer:Movie {title:'Speed Racer', released:2008, tagline:'Speed has no limits'})\n",
    "CREATE (EmileH:Person {name:'Emile Hirsch', born:1985})\n",
    "CREATE (JohnG:Person {name:'John Goodman', born:1960})\n",
    "CREATE (SusanS:Person {name:'Susan Sarandon', born:1946})\n",
    "CREATE (MatthewF:Person {name:'Matthew Fox', born:1966})\n",
    "CREATE (ChristinaR:Person {name:'Christina Ricci', born:1980})\n",
    "CREATE (Rain:Person {name:'Rain', born:1982})\n",
    "CREATE\n",
    "  (EmileH)-[:ACTED_IN {roles:['Speed Racer']}]->(SpeedRacer),\n",
    "  (JohnG)-[:ACTED_IN {roles:['Pops']}]->(SpeedRacer),\n",
    "  (SusanS)-[:ACTED_IN {roles:['Mom']}]->(SpeedRacer),\n",
    "  (MatthewF)-[:ACTED_IN {roles:['Racer X']}]->(SpeedRacer),\n",
    "  (ChristinaR)-[:ACTED_IN {roles:['Trixie']}]->(SpeedRacer),\n",
    "  (Rain)-[:ACTED_IN {roles:['Taejo Togokahn']}]->(SpeedRacer),\n",
    "  (BenM)-[:ACTED_IN {roles:['Cass Jones']}]->(SpeedRacer),\n",
    "  (LillyW)-[:DIRECTED]->(SpeedRacer),\n",
    "  (LanaW)-[:DIRECTED]->(SpeedRacer),\n",
    "  (LillyW)-[:WROTE]->(SpeedRacer),\n",
    "  (LanaW)-[:WROTE]->(SpeedRacer),\n",
    "  (JoelS)-[:PRODUCED]->(SpeedRacer)\n",
    "\n",
    "CREATE (NinjaAssassin:Movie {title:'Ninja Assassin', released:2009, tagline:'Prepare to enter a secret world of assassins'})\n",
    "CREATE (NaomieH:Person {name:'Naomie Harris'})\n",
    "CREATE\n",
    "  (Rain)-[:ACTED_IN {roles:['Raizo']}]->(NinjaAssassin),\n",
    "  (NaomieH)-[:ACTED_IN {roles:['Mika Coretti']}]->(NinjaAssassin),\n",
    "  (RickY)-[:ACTED_IN {roles:['Takeshi']}]->(NinjaAssassin),\n",
    "  (BenM)-[:ACTED_IN {roles:['Ryan Maslow']}]->(NinjaAssassin),\n",
    "  (JamesM)-[:DIRECTED]->(NinjaAssassin),\n",
    "  (LillyW)-[:PRODUCED]->(NinjaAssassin),\n",
    "  (LanaW)-[:PRODUCED]->(NinjaAssassin),\n",
    "  (JoelS)-[:PRODUCED]->(NinjaAssassin)\n",
    "\n",
    "CREATE (TheGreenMile:Movie {title:'The Green Mile', released:1999, tagline:\"Walk a mile you'll never forget.\"})\n",
    "CREATE (MichaelD:Person {name:'Michael Clarke Duncan', born:1957})\n",
    "CREATE (DavidM:Person {name:'David Morse', born:1953})\n",
    "CREATE (SamR:Person {name:'Sam Rockwell', born:1968})\n",
    "CREATE (GaryS:Person {name:'Gary Sinise', born:1955})\n",
    "CREATE (PatriciaC:Person {name:'Patricia Clarkson', born:1959})\n",
    "CREATE (FrankD:Person {name:'Frank Darabont', born:1959})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Paul Edgecomb']}]->(TheGreenMile),\n",
    "  (MichaelD)-[:ACTED_IN {roles:['John Coffey']}]->(TheGreenMile),\n",
    "  (DavidM)-[:ACTED_IN {roles:['Brutus \"Brutal\" Howell']}]->(TheGreenMile),\n",
    "  (BonnieH)-[:ACTED_IN {roles:['Jan Edgecomb']}]->(TheGreenMile),\n",
    "  (JamesC)-[:ACTED_IN {roles:['Warden Hal Moores']}]->(TheGreenMile),\n",
    "  (SamR)-[:ACTED_IN {roles:['\"Wild Bill\" Wharton']}]->(TheGreenMile),\n",
    "  (GaryS)-[:ACTED_IN {roles:['Burt Hammersmith']}]->(TheGreenMile),\n",
    "  (PatriciaC)-[:ACTED_IN {roles:['Melinda Moores']}]->(TheGreenMile),\n",
    "  (FrankD)-[:DIRECTED]->(TheGreenMile)\n",
    "\n",
    "CREATE (FrostNixon:Movie {title:'Frost/Nixon', released:2008, tagline:'400 million people were waiting for the truth.'})\n",
    "CREATE (FrankL:Person {name:'Frank Langella', born:1938})\n",
    "CREATE (MichaelS:Person {name:'Michael Sheen', born:1969})\n",
    "CREATE (OliverP:Person {name:'Oliver Platt', born:1960})\n",
    "CREATE\n",
    "  (FrankL)-[:ACTED_IN {roles:['Richard Nixon']}]->(FrostNixon),\n",
    "  (MichaelS)-[:ACTED_IN {roles:['David Frost']}]->(FrostNixon),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Jack Brennan']}]->(FrostNixon),\n",
    "  (OliverP)-[:ACTED_IN {roles:['Bob Zelnick']}]->(FrostNixon),\n",
    "  (SamR)-[:ACTED_IN {roles:['James Reston, Jr.']}]->(FrostNixon),\n",
    "  (RonH)-[:DIRECTED]->(FrostNixon)\n",
    "\n",
    "CREATE (Hoffa:Movie {title:'Hoffa', released:1992, tagline:\"He didn't want law. He wanted justice.\"})\n",
    "CREATE (DannyD:Person {name:'Danny DeVito', born:1944})\n",
    "CREATE (JohnR:Person {name:'John C. Reilly', born:1965})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Hoffa']}]->(Hoffa),\n",
    "  (DannyD)-[:ACTED_IN {roles:['Robert \"Bobby\" Ciaro']}]->(Hoffa),\n",
    "  (JTW)-[:ACTED_IN {roles:['Frank Fitzsimmons']}]->(Hoffa),\n",
    "  (JohnR)-[:ACTED_IN {roles:['Peter \"Pete\" Connelly']}]->(Hoffa),\n",
    "  (DannyD)-[:DIRECTED]->(Hoffa)\n",
    "\n",
    "CREATE (Apollo13:Movie {title:'Apollo 13', released:1995, tagline:'Houston, we have a problem.'})\n",
    "CREATE (EdH:Person {name:'Ed Harris', born:1950})\n",
    "CREATE (BillPax:Person {name:'Bill Paxton', born:1955})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Jim Lovell']}]->(Apollo13),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Jack Swigert']}]->(Apollo13),\n",
    "  (EdH)-[:ACTED_IN {roles:['Gene Kranz']}]->(Apollo13),\n",
    "  (BillPax)-[:ACTED_IN {roles:['Fred Haise']}]->(Apollo13),\n",
    "  (GaryS)-[:ACTED_IN {roles:['Ken Mattingly']}]->(Apollo13),\n",
    "  (RonH)-[:DIRECTED]->(Apollo13)\n",
    "\n",
    "CREATE (Twister:Movie {title:'Twister', released:1996, tagline:\"Don't Breathe. Don't Look Back.\"})\n",
    "CREATE (PhilipH:Person {name:'Philip Seymour Hoffman', born:1967})\n",
    "CREATE (JanB:Person {name:'Jan de Bont', born:1943})\n",
    "CREATE\n",
    "  (BillPax)-[:ACTED_IN {roles:['Bill Harding']}]->(Twister),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Dr. Jo Harding']}]->(Twister),\n",
    "  (ZachG)-[:ACTED_IN {roles:['Eddie']}]->(Twister),\n",
    "  (PhilipH)-[:ACTED_IN {roles:['Dustin \"Dusty\" Davis']}]->(Twister),\n",
    "  (JanB)-[:DIRECTED]->(Twister)\n",
    "\n",
    "CREATE (CastAway:Movie {title:'Cast Away', released:2000, tagline:'At the edge of the world, his journey begins.'})\n",
    "CREATE (RobertZ:Person {name:'Robert Zemeckis', born:1951})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Chuck Noland']}]->(CastAway),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Kelly Frears']}]->(CastAway),\n",
    "  (RobertZ)-[:DIRECTED]->(CastAway)\n",
    "\n",
    "CREATE (OneFlewOvertheCuckoosNest:Movie {title:\"One Flew Over the Cuckoo's Nest\", released:1975, tagline:\"If he's crazy, what does that make you?\"})\n",
    "CREATE (MilosF:Person {name:'Milos Forman', born:1932})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Randle McMurphy']}]->(OneFlewOvertheCuckoosNest),\n",
    "  (DannyD)-[:ACTED_IN {roles:['Martini']}]->(OneFlewOvertheCuckoosNest),\n",
    "  (MilosF)-[:DIRECTED]->(OneFlewOvertheCuckoosNest)\n",
    "\n",
    "CREATE (SomethingsGottaGive:Movie {title:\"Something's Gotta Give\", released:2003})\n",
    "CREATE (DianeK:Person {name:'Diane Keaton', born:1946})\n",
    "CREATE (NancyM:Person {name:'Nancy Meyers', born:1949})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Harry Sanborn']}]->(SomethingsGottaGive),\n",
    "  (DianeK)-[:ACTED_IN {roles:['Erica Barry']}]->(SomethingsGottaGive),\n",
    "  (Keanu)-[:ACTED_IN {roles:['Julian Mercer']}]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:DIRECTED]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:PRODUCED]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:WROTE]->(SomethingsGottaGive)\n",
    "\n",
    "CREATE (BicentennialMan:Movie {title:'Bicentennial Man', released:1999, tagline:\"One robot's 200 year journey to become an ordinary man.\"})\n",
    "CREATE (ChrisC:Person {name:'Chris Columbus', born:1958})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Andrew Marin']}]->(BicentennialMan),\n",
    "  (OliverP)-[:ACTED_IN {roles:['Rupert Burns']}]->(BicentennialMan),\n",
    "  (ChrisC)-[:DIRECTED]->(BicentennialMan)\n",
    "\n",
    "CREATE (CharlieWilsonsWar:Movie {title:\"Charlie Wilson's War\", released:2007, tagline:\"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\"})\n",
    "CREATE (JuliaR:Person {name:'Julia Roberts', born:1967})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Rep. Charlie Wilson']}]->(CharlieWilsonsWar),\n",
    "  (JuliaR)-[:ACTED_IN {roles:['Joanne Herring']}]->(CharlieWilsonsWar),\n",
    "  (PhilipH)-[:ACTED_IN {roles:['Gust Avrakotos']}]->(CharlieWilsonsWar),\n",
    "  (MikeN)-[:DIRECTED]->(CharlieWilsonsWar)\n",
    "\n",
    "CREATE (ThePolarExpress:Movie {title:'The Polar Express', released:2004, tagline:'This Holiday Season… Believe'})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Hero Boy', 'Father', 'Conductor', 'Hobo', 'Scrooge', 'Santa Claus']}]->(ThePolarExpress),\n",
    "  (RobertZ)-[:DIRECTED]->(ThePolarExpress)\n",
    "\n",
    "CREATE (ALeagueofTheirOwn:Movie {title:'A League of Their Own', released:1992, tagline:'Once in a lifetime you get a chance to do something different.'})\n",
    "CREATE (Madonna:Person {name:'Madonna', born:1954})\n",
    "CREATE (GeenaD:Person {name:'Geena Davis', born:1956})\n",
    "CREATE (LoriP:Person {name:'Lori Petty', born:1963})\n",
    "CREATE (PennyM:Person {name:'Penny Marshall', born:1943})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Jimmy Dugan']}]->(ALeagueofTheirOwn),\n",
    "  (GeenaD)-[:ACTED_IN {roles:['Dottie Hinson']}]->(ALeagueofTheirOwn),\n",
    "  (LoriP)-[:ACTED_IN {roles:['Kit Keller']}]->(ALeagueofTheirOwn),\n",
    "  (RosieO)-[:ACTED_IN {roles:['Doris Murphy']}]->(ALeagueofTheirOwn),\n",
    "  (Madonna)-[:ACTED_IN {roles:['\"All the Way\" Mae Mordabito']}]->(ALeagueofTheirOwn),\n",
    "  (BillPax)-[:ACTED_IN {roles:['Bob Hinson']}]->(ALeagueofTheirOwn),\n",
    "  (PennyM)-[:DIRECTED]->(ALeagueofTheirOwn)\n",
    "\n",
    "CREATE (PaulBlythe:Person {name:'Paul Blythe'})\n",
    "CREATE (AngelaScope:Person {name:'Angela Scope'})\n",
    "CREATE (JessicaThompson:Person {name:'Jessica Thompson'})\n",
    "CREATE (JamesThompson:Person {name:'James Thompson'})\n",
    "\n",
    "CREATE\n",
    "  (JamesThompson)-[:FOLLOWS]->(JessicaThompson),\n",
    "  (AngelaScope)-[:FOLLOWS]->(JessicaThompson),\n",
    "  (PaulBlythe)-[:FOLLOWS]->(AngelaScope)\n",
    "\n",
    "CREATE\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'An amazing journey', rating:95}]->(CloudAtlas),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'Silly, but fun', rating:65}]->(TheReplacements),\n",
    "  (JamesThompson)-[:REVIEWED {summary:'The coolest football movie ever', rating:100}]->(TheReplacements),\n",
    "  (AngelaScope)-[:REVIEWED {summary:'Pretty funny at times', rating:62}]->(TheReplacements),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'Dark, but compelling', rating:85}]->(Unforgiven),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:\"Slapstick redeemed only by the Robin Williams and Gene Hackman's stellar performances\", rating:45}]->(TheBirdcage),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'A solid romp', rating:68}]->(TheDaVinciCode),\n",
    "  (JamesThompson)-[:REVIEWED {summary:'Fun, but a little far fetched', rating:65}]->(TheDaVinciCode),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'You had me at Jerry', rating:92}]->(JerryMaguire)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Schema\n",
    "\n",
    "A imagem abaixo representa o schema do banco de dados.\n",
    "\n",
    "<img src=\"./resources/graph.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Exemplo] Em que ano nasceu a pessoa com nome Tom Hanks?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>node</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)\n",
    "WHERE node.name='Tom Hanks'\n",
    "RETURN node\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Exemplo] Encontre o filme com nome Cloud Atlas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>node</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Everything is connected&#x27;, &#x27;title&#x27;: &#x27;Cloud Atlas&#x27;, &#x27;released&#x27;: 2012}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'tagline': 'Everything is connected',\n",
       "   'title': 'Cloud Atlas',\n",
       "   'released': 2012}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node:Movie)\n",
    "WHERE node.title='Cloud Atlas'\n",
    "RETURN node\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Exemplo]  Liste apenas o nome de 10 filmes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>node.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Reloaded</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Revolutions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Top Gun</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry Maguire</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stand By Me</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix'],\n",
       " ['The Matrix Reloaded'],\n",
       " ['The Matrix Revolutions'],\n",
       " [\"The Devil's Advocate\"],\n",
       " ['A Few Good Men'],\n",
       " ['Top Gun'],\n",
       " ['Jerry Maguire'],\n",
       " ['Stand By Me'],\n",
       " ['As Good as It Gets'],\n",
       " ['What Dreams May Come']]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node:Movie)\n",
    "RETURN node.title LIMIT 10\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Exemplo] Liste todos os filmes em que Tom Hanks atuou"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Titulo_do_Filme</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[\"You've Got Mail\"],\n",
       " ['Sleepless in Seattle'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['That Thing You Do'],\n",
       " ['Cloud Atlas'],\n",
       " ['The Da Vinci Code'],\n",
       " ['The Green Mile'],\n",
       " ['Apollo 13'],\n",
       " ['Cast Away'],\n",
       " [\"Charlie Wilson's War\"],\n",
       " ['The Polar Express'],\n",
       " ['A League of Their Own']]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)\n",
    "WHERE node.name='Tom Hanks'\n",
    "RETURN node2.title as Titulo_do_Filme"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 1] Liste o nome de até 10 filmes lançados entre 1990 e 1999"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Titulo_do_Filme</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix'],\n",
       " [\"The Devil's Advocate\"],\n",
       " ['A Few Good Men'],\n",
       " ['As Good as It Gets'],\n",
       " ['What Dreams May Come'],\n",
       " ['Snow Falling on Cedars'],\n",
       " [\"You've Got Mail\"],\n",
       " ['Sleepless in Seattle'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['When Harry Met Sally']]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node:Movie)\n",
    "WHERE node.released > 1989 AND node.released < 2000 \n",
    "RETURN node.title as Titulo_do_Filme LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 2] Qual(is) o(s) nome(s) do(s) diretor(es) do filme Cloud Atlas?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Diretores_Cloud_Atlas</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Tykwer'], ['Lana Wachowski'], ['Lilly Wachowski']]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:DIRECTED]->(node2:Movie)\n",
    "WHERE node2.title='Cloud Atlas'\n",
    "RETURN node.name as Diretores_Cloud_Atlas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 3] Quais são os nomes do outros atores que atuaram no filme Cloud Atlas?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Atores_Cloud_Atlas</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Hanks'], ['Jim Broadbent'], ['Halle Berry'], ['Hugo Weaving']]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)\n",
    "WHERE node2.title='Cloud Atlas'\n",
    "RETURN node.name as Atores_Cloud_Atlas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 4] Existe algum filme em que o Tom Hanks tenha dirigido e atuado? Se sim, qual o nome e ano de lançamento?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Titulo_do_Filme</th>\n",
       "        <th>Ano_Lançamento</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['That Thing You Do', 1996]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)<-[:DIRECTED]-(node)\n",
    "WHERE node.name='Tom Hanks'\n",
    "RETURN node2.title as Titulo_do_Filme, node2.released as Ano_Lançamento"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 5] Liste o nome de 10 diretores que dirigiram filmes em que o Tom Hanks atuou"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "dica:\n",
    "``` cypher\n",
    "MATCH (a)-[:ACTED_IN]->(m)<-[:DIRECTED]-(d) RETURN a,m,d LIMIT 10\n",
    "```                                                                           "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Diretores</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nora Ephron</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Patrick Stanley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ron Howard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frank Darabont</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert Zemeckis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Mike Nichols</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nora Ephron'],\n",
       " ['John Patrick Stanley'],\n",
       " ['Tom Hanks'],\n",
       " ['Tom Tykwer'],\n",
       " ['Lana Wachowski'],\n",
       " ['Lilly Wachowski'],\n",
       " ['Ron Howard'],\n",
       " ['Frank Darabont'],\n",
       " ['Robert Zemeckis'],\n",
       " ['Mike Nichols']]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)<-[:DIRECTED]-(node3)\n",
    "WHERE node.name='Tom Hanks'\n",
    "RETURN DISTINCT node3.name as Diretores LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 6] Existe algum filme em que ambos Kevin Bacon e Tom Cruise tenham atuado? Se sim, qual o nome e ano de laçamento?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Titulo_do_Filme</th>\n",
       "        <th>Ano_Lançamento</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['A Few Good Men', 1992]]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)<-[:ACTED_IN]-(node3)\n",
    "WHERE node.name='Tom Cruise' AND node3.name='Kevin Bacon'\n",
    "RETURN node2.title as Titulo_do_Filme, node2.released as Ano_Lançamento"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão 7] Liste o nome de 10 pessoas que também atuaram em filmes com o Tom Hanks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Atores</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Parker Posey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Greg Kinnear</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Steve Zahn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dave Chappelle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Victor Garber</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Pullman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rita Wilson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nathan Lane</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Parker Posey'],\n",
       " ['Greg Kinnear'],\n",
       " ['Meg Ryan'],\n",
       " ['Steve Zahn'],\n",
       " ['Dave Chappelle'],\n",
       " ['Victor Garber'],\n",
       " ['Bill Pullman'],\n",
       " ['Rita Wilson'],\n",
       " [\"Rosie O'Donnell\"],\n",
       " ['Nathan Lane']]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node2:Movie)<-[:ACTED_IN]-(node3)\n",
    "WHERE node.name='Tom Hanks'\n",
    "RETURN DISTINCT node3.name as Atores LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão extra] Quem mais produziu filmes do Tom Hanks e do Kevin Bacon?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Producers_TH</th>\n",
       "        <th>Producers_KB</th>\n",
       "        <th>count(*)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stefan Arndt</td>\n",
       "        <td>Joel Silver</td>\n",
       "        <td>29</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Stefan Arndt', 'Joel Silver', 29]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:ACTED_IN]->(node1:Movie)<-[:PRODUCED]-(node2)\n",
    "MATCH (node3)-[:ACTED_IN]->(node4:Movie)<-[:PRODUCED]-(node5) \n",
    "WHERE node.name='Tom Hanks' OR node3.name='Kevin Bacon'\n",
    "RETURN node2.name as Producers_TH, node5.name as Producers_KB, count(*) LIMIT 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Extra] Quem tem mais seguidores?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Mais_Seguidores</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jessica Thompson</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Jessica Thompson']]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:FOLLOWS]->(node1)\n",
    "RETURN max(node1.name) as Mais_Seguidores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Extra] Liste o(s) nomeQ(s) da(s) pessoa(s) que produziram, escreveram e dirigiram o mesmo filme"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Nomes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cameron Crowe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nancy Meyers</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Cameron Crowe'], ['Nancy Meyers']]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[:PRODUCED]->(node2:Movie)\n",
    "MATCH (node)-[:WROTE]->(node2:Movie)\n",
    "MATCH (node)-[:DIRECTED]->(node2:Movie)\n",
    "RETURN node.name as Nomes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## [Questão Extra] Qual a média de notas (reviewed) do filme The Replacements?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Media_Notas</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>75.66666666666667</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[75.66666666666667]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (node)-[r:REVIEWED]->(node2:Movie)\n",
    "WHERE node2.title='The Replacements'\n",
    "RETURN avg(r.rating) as Media_Notas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Conhecendo um pouco mais Cypher\n",
    "\n",
    "https://neo4j.com/docs/cypher-manual/3.5/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Filmes e atores com 4 nós de separação de Kevin Bacon\n",
    "``` cypher\n",
    "MATCH (bacon:Person {name:\"Kevin Bacon\"})-[*1..4]-(hollywood)\n",
    "RETURN DISTINCT hollywood\n",
    "```\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "135 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>hollywood</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1941, &#x27;name&#x27;: &#x27;Nora Ephron&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Parker Posey&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Greg Kinnear&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Meg Ryan&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Steve Zahn&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1973, &#x27;name&#x27;: &#x27;Dave Chappelle&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;At odds in life... in love on-line.&#x27;, &#x27;title&#x27;: &quot;You&#x27;ve Got Mail&quot;, &#x27;released&#x27;: 1998}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Madonna&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;Penny Marshall&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &quot;Rosie O&#x27;Donnell&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Geena Davis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1955, &#x27;name&#x27;: &#x27;Bill Paxton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Lori Petty&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Once in a lifetime you get a chance to do something different.&#x27;, &#x27;title&#x27;: &#x27;A League of Their Own&#x27;, &#x27;released&#x27;: 1992}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1950, &#x27;name&#x27;: &#x27;John Patrick Stanley&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Nathan Lane&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;A story of love, lava and burning desire.&#x27;, &#x27;title&#x27;: &#x27;Joe Versus the Volcano&#x27;, &#x27;released&#x27;: 1990}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1977, &#x27;name&#x27;: &#x27;Liv Tyler&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1975, &#x27;name&#x27;: &#x27;Charlize Theron&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;In every life there comes a time when that thing you dream becomes that thing you do&#x27;, &#x27;title&#x27;: &#x27;That Thing You Do&#x27;, &#x27;released&#x27;: 1996}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Jessica Thompson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;James Thompson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Ron Howard&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1939, &#x27;name&#x27;: &#x27;Ian McKellen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1976, &#x27;name&#x27;: &#x27;Audrey Tautou&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Paul Bettany&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Break The Codes&#x27;, &#x27;title&#x27;: &#x27;The Da Vinci Code&#x27;, &#x27;released&#x27;: 2006}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Jim Broadbent&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;David Mitchell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Tom Tykwer&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Stefan Arndt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;Halle Berry&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Lilly Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Everything is connected&#x27;, &#x27;title&#x27;: &#x27;Cloud Atlas&#x27;, &#x27;released&#x27;: 2012}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Helen Hunt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1951, &#x27;name&#x27;: &#x27;Robert Zemeckis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;At the edge of the world, his journey begins.&#x27;, &#x27;title&#x27;: &#x27;Cast Away&#x27;, &#x27;released&#x27;: 2000}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Sam Rockwell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Bonnie Hunt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Patricia Clarkson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;James Cromwell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Frank Darabont&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Michael Clarke Duncan&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;David Morse&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1955, &#x27;name&#x27;: &#x27;Gary Sinise&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;Walk a mile you&#x27;ll never forget.&quot;, &#x27;title&#x27;: &#x27;The Green Mile&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Victor Garber&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;Bill Pullman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Rita Wilson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;What if someone you never met, someone you never saw, someone you never knew was the only someone for you?&#x27;, &#x27;title&#x27;: &#x27;Sleepless in Seattle&#x27;, &#x27;released&#x27;: 1993}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;This Holiday Season… Believe&#x27;, &#x27;title&#x27;: &#x27;The Polar Express&#x27;, &#x27;released&#x27;: 2004}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Julia Roberts&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1931, &#x27;name&#x27;: &#x27;Mike Nichols&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Philip Seymour Hoffman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;A stiff drink. A little mascara. A lot of nerve. Who said they couldn&#x27;t bring down the Soviet empire.&quot;, &#x27;title&#x27;: &quot;Charlie Wilson&#x27;s War&quot;, &#x27;released&#x27;: 2007}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;Michael Sheen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1938, &#x27;name&#x27;: &#x27;Frank Langella&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Oliver Platt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Kevin Bacon&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;400 million people were waiting for the truth.&#x27;, &#x27;title&#x27;: &#x27;Frost/Nixon&#x27;, &#x27;released&#x27;: 2008}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1950, &#x27;name&#x27;: &#x27;Ed Harris&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;Jan de Bont&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Zach Grenier&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;Don&#x27;t Breathe. Don&#x27;t Look Back.&quot;, &#x27;title&#x27;: &#x27;Twister&#x27;, &#x27;released&#x27;: 1996}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Houston, we have a problem.&#x27;, &#x27;title&#x27;: &#x27;Apollo 13&#x27;, &#x27;released&#x27;: 1995}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1951, &#x27;name&#x27;: &#x27;Robin Williams&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Chris Columbus&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;One robot&#x27;s 200 year journey to become an ordinary man.&quot;, &#x27;title&#x27;: &#x27;Bicentennial Man&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1982, &#x27;name&#x27;: &#x27;Rain&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Ben Miles&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Rick Yune&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Naomie Harris&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Prepare to enter a secret world of assassins&#x27;, &#x27;title&#x27;: &#x27;Ninja Assassin&#x27;, &#x27;released&#x27;: 2009}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;John Hurt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1946, &#x27;name&#x27;: &#x27;Stephen Rea&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1981, &#x27;name&#x27;: &#x27;Natalie Portman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Freedom! Forever!&#x27;, &#x27;title&#x27;: &#x27;V for Vendetta&#x27;, &#x27;released&#x27;: 2006}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;James Marshall&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Kevin Pollak&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;John C. Reilly&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1944, &#x27;name&#x27;: &#x27;Danny DeVito&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1937, &#x27;name&#x27;: &#x27;Jack Nicholson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;He didn&#x27;t want law. He wanted justice.&quot;, &#x27;title&#x27;: &#x27;Hoffa&#x27;, &#x27;released&#x27;: 1992}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;J.T. Walsh&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Cuba Gooding Jr.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1948, &#x27;name&#x27;: &#x27;Christopher Guest&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1947, &#x27;name&#x27;: &#x27;Rob Reiner&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Noah Wyle&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;Kiefer Sutherland&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Demi Moore&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Tom Cruise&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;In the heart of the nation&#x27;s capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.&quot;, &#x27;title&#x27;: &#x27;A Few Good Men&#x27;, &#x27;released&#x27;: 1992}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Aaron Sorkin&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Vincent Ward&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1929, &#x27;name&#x27;: &#x27;Max von Sydow&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1942, &#x27;name&#x27;: &#x27;Werner Herzog&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Annabella Sciorra&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;After life there is more. The end is just the beginning.&#x27;, &#x27;title&#x27;: &#x27;What Dreams May Come&#x27;, &#x27;released&#x27;: 1998}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1974, &#x27;name&#x27;: &quot;Jerry O&#x27;Connell&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Cameron Crowe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;Jay Mohr&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1996, &#x27;name&#x27;: &#x27;Jonathan Lipnicki&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;Renee Zellweger&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Kelly Preston&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Regina King&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;The rest of his life begins now.&#x27;, &#x27;title&#x27;: &#x27;Jerry Maguire&#x27;, &#x27;released&#x27;: 2000}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;James L. Brooks&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;A comedy from the heart that goes for the throat.&#x27;, &#x27;title&#x27;: &#x27;As Good as It Gets&#x27;, &#x27;released&#x27;: 1997}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;River Phoenix&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1942, &#x27;name&#x27;: &#x27;Marshall Bell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1972, &#x27;name&#x27;: &#x27;Wil Wheaton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;John Cusack&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Corey Feldman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;For some, it&#x27;s the last real taste of innocence, and the first real taste of life. But for everyone, it&#x27;s the time that memories are made of.&quot;, &#x27;title&#x27;: &#x27;Stand By Me&#x27;, &#x27;released&#x27;: 1986}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Carrie Fisher&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1948, &#x27;name&#x27;: &#x27;Billy Crystal&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Bruno Kirby&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Can two friends sleep together and still love each other in the morning?&#x27;, &#x27;title&#x27;: &#x27;When Harry Met Sally&#x27;, &#x27;released&#x27;: 1998}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1932, &#x27;name&#x27;: &#x27;Milos Forman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &quot;If he&#x27;s crazy, what does that make you?&quot;, &#x27;title&#x27;: &quot;One Flew Over the Cuckoo&#x27;s Nest&quot;, &#x27;released&#x27;: 1975}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Nancy Meyers&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1946, &#x27;name&#x27;: &#x27;Diane Keaton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;title&#x27;: &quot;Something&#x27;s Gotta Give&quot;, &#x27;released&#x27;: 2003}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1941, &#x27;name&#x27;: &#x27;Jim Cash&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Val Kilmer&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1944, &#x27;name&#x27;: &#x27;Tony Scott&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1933, &#x27;name&#x27;: &#x27;Tom Skerritt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Kelly McGillis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Anthony Edwards&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;I feel the need, the need for speed.&#x27;, &#x27;title&#x27;: &#x27;Top Gun&#x27;, &#x27;released&#x27;: 1986}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1941, 'name': 'Nora Ephron'}],\n",
       " [{'born': 1968, 'name': 'Parker Posey'}],\n",
       " [{'born': 1963, 'name': 'Greg Kinnear'}],\n",
       " [{'born': 1961, 'name': 'Meg Ryan'}],\n",
       " [{'born': 1967, 'name': 'Steve Zahn'}],\n",
       " [{'born': 1973, 'name': 'Dave Chappelle'}],\n",
       " [{'tagline': 'At odds in life... in love on-line.',\n",
       "   'title': \"You've Got Mail\",\n",
       "   'released': 1998}],\n",
       " [{'born': 1954, 'name': 'Madonna'}],\n",
       " [{'born': 1943, 'name': 'Penny Marshall'}],\n",
       " [{'born': 1962, 'name': \"Rosie O'Donnell\"}],\n",
       " [{'born': 1956, 'name': 'Geena Davis'}],\n",
       " [{'born': 1955, 'name': 'Bill Paxton'}],\n",
       " [{'born': 1963, 'name': 'Lori Petty'}],\n",
       " [{'tagline': 'Once in a lifetime you get a chance to do something different.',\n",
       "   'title': 'A League of Their Own',\n",
       "   'released': 1992}],\n",
       " [{'born': 1950, 'name': 'John Patrick Stanley'}],\n",
       " [{'born': 1956, 'name': 'Nathan Lane'}],\n",
       " [{'tagline': 'A story of love, lava and burning desire.',\n",
       "   'title': 'Joe Versus the Volcano',\n",
       "   'released': 1990}],\n",
       " [{'born': 1977, 'name': 'Liv Tyler'}],\n",
       " [{'born': 1975, 'name': 'Charlize Theron'}],\n",
       " [{'born': 1956, 'name': 'Tom Hanks'}],\n",
       " [{'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
       "   'title': 'That Thing You Do',\n",
       "   'released': 1996}],\n",
       " [{'name': 'Jessica Thompson'}],\n",
       " [{'name': 'James Thompson'}],\n",
       " [{'born': 1954, 'name': 'Ron Howard'}],\n",
       " [{'born': 1939, 'name': 'Ian McKellen'}],\n",
       " [{'born': 1976, 'name': 'Audrey Tautou'}],\n",
       " [{'born': 1971, 'name': 'Paul Bettany'}],\n",
       " [{'tagline': 'Break The Codes',\n",
       "   'title': 'The Da Vinci Code',\n",
       "   'released': 2006}],\n",
       " [{'born': 1949, 'name': 'Jim Broadbent'}],\n",
       " [{'born': 1969, 'name': 'David Mitchell'}],\n",
       " [{'born': 1965, 'name': 'Tom Tykwer'}],\n",
       " [{'born': 1965, 'name': 'Lana Wachowski'}],\n",
       " [{'born': 1961, 'name': 'Stefan Arndt'}],\n",
       " [{'born': 1966, 'name': 'Halle Berry'}],\n",
       " [{'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'born': 1967, 'name': 'Lilly Wachowski'}],\n",
       " [{'tagline': 'Everything is connected',\n",
       "   'title': 'Cloud Atlas',\n",
       "   'released': 2012}],\n",
       " [{'born': 1963, 'name': 'Helen Hunt'}],\n",
       " [{'born': 1951, 'name': 'Robert Zemeckis'}],\n",
       " [{'tagline': 'At the edge of the world, his journey begins.',\n",
       "   'title': 'Cast Away',\n",
       "   'released': 2000}],\n",
       " [{'born': 1968, 'name': 'Sam Rockwell'}],\n",
       " [{'born': 1961, 'name': 'Bonnie Hunt'}],\n",
       " [{'born': 1959, 'name': 'Patricia Clarkson'}],\n",
       " [{'born': 1940, 'name': 'James Cromwell'}],\n",
       " [{'born': 1959, 'name': 'Frank Darabont'}],\n",
       " [{'born': 1957, 'name': 'Michael Clarke Duncan'}],\n",
       " [{'born': 1953, 'name': 'David Morse'}],\n",
       " [{'born': 1955, 'name': 'Gary Sinise'}],\n",
       " [{'tagline': \"Walk a mile you'll never forget.\",\n",
       "   'title': 'The Green Mile',\n",
       "   'released': 1999}],\n",
       " [{'born': 1949, 'name': 'Victor Garber'}],\n",
       " [{'born': 1953, 'name': 'Bill Pullman'}],\n",
       " [{'born': 1956, 'name': 'Rita Wilson'}],\n",
       " [{'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?',\n",
       "   'title': 'Sleepless in Seattle',\n",
       "   'released': 1993}],\n",
       " [{'tagline': 'This Holiday Season… Believe',\n",
       "   'title': 'The Polar Express',\n",
       "   'released': 2004}],\n",
       " [{'born': 1967, 'name': 'Julia Roberts'}],\n",
       " [{'born': 1931, 'name': 'Mike Nichols'}],\n",
       " [{'born': 1967, 'name': 'Philip Seymour Hoffman'}],\n",
       " [{'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\",\n",
       "   'title': \"Charlie Wilson's War\",\n",
       "   'released': 2007}],\n",
       " [{'born': 1969, 'name': 'Michael Sheen'}],\n",
       " [{'born': 1938, 'name': 'Frank Langella'}],\n",
       " [{'born': 1960, 'name': 'Oliver Platt'}],\n",
       " [{'born': 1958, 'name': 'Kevin Bacon'}],\n",
       " [{'tagline': '400 million people were waiting for the truth.',\n",
       "   'title': 'Frost/Nixon',\n",
       "   'released': 2008}],\n",
       " [{'born': 1950, 'name': 'Ed Harris'}],\n",
       " [{'born': 1943, 'name': 'Jan de Bont'}],\n",
       " [{'born': 1954, 'name': 'Zach Grenier'}],\n",
       " [{'tagline': \"Don't Breathe. Don't Look Back.\",\n",
       "   'title': 'Twister',\n",
       "   'released': 1996}],\n",
       " [{'tagline': 'Houston, we have a problem.',\n",
       "   'title': 'Apollo 13',\n",
       "   'released': 1995}],\n",
       " [{'born': 1951, 'name': 'Robin Williams'}],\n",
       " [{'born': 1958, 'name': 'Chris Columbus'}],\n",
       " [{'tagline': \"One robot's 200 year journey to become an ordinary man.\",\n",
       "   'title': 'Bicentennial Man',\n",
       "   'released': 1999}],\n",
       " [{'born': 1982, 'name': 'Rain'}],\n",
       " [{'born': 1967, 'name': 'Ben Miles'}],\n",
       " [{'born': 1971, 'name': 'Rick Yune'}],\n",
       " [{'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'name': 'Naomie Harris'}],\n",
       " [{'tagline': 'Prepare to enter a secret world of assassins',\n",
       "   'title': 'Ninja Assassin',\n",
       "   'released': 2009}],\n",
       " [{'born': 1940, 'name': 'John Hurt'}],\n",
       " [{'born': 1946, 'name': 'Stephen Rea'}],\n",
       " [{'born': 1981, 'name': 'Natalie Portman'}],\n",
       " [{'tagline': 'Freedom! Forever!',\n",
       "   'title': 'V for Vendetta',\n",
       "   'released': 2006}],\n",
       " [{'born': 1967, 'name': 'James Marshall'}],\n",
       " [{'born': 1957, 'name': 'Kevin Pollak'}],\n",
       " [{'born': 1965, 'name': 'John C. Reilly'}],\n",
       " [{'born': 1944, 'name': 'Danny DeVito'}],\n",
       " [{'born': 1937, 'name': 'Jack Nicholson'}],\n",
       " [{'tagline': \"He didn't want law. He wanted justice.\",\n",
       "   'title': 'Hoffa',\n",
       "   'released': 1992}],\n",
       " [{'born': 1943, 'name': 'J.T. Walsh'}],\n",
       " [{'born': 1968, 'name': 'Cuba Gooding Jr.'}],\n",
       " [{'born': 1948, 'name': 'Christopher Guest'}],\n",
       " [{'born': 1947, 'name': 'Rob Reiner'}],\n",
       " [{'born': 1971, 'name': 'Noah Wyle'}],\n",
       " [{'born': 1966, 'name': 'Kiefer Sutherland'}],\n",
       " [{'born': 1962, 'name': 'Demi Moore'}],\n",
       " [{'born': 1962, 'name': 'Tom Cruise'}],\n",
       " [{'tagline': \"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\",\n",
       "   'title': 'A Few Good Men',\n",
       "   'released': 1992}],\n",
       " [{'born': 1961, 'name': 'Aaron Sorkin'}],\n",
       " [{'born': 1956, 'name': 'Vincent Ward'}],\n",
       " [{'born': 1929, 'name': 'Max von Sydow'}],\n",
       " [{'born': 1942, 'name': 'Werner Herzog'}],\n",
       " [{'born': 1960, 'name': 'Annabella Sciorra'}],\n",
       " [{'tagline': 'After life there is more. The end is just the beginning.',\n",
       "   'title': 'What Dreams May Come',\n",
       "   'released': 1998}],\n",
       " [{'born': 1974, 'name': \"Jerry O'Connell\"}],\n",
       " [{'born': 1957, 'name': 'Cameron Crowe'}],\n",
       " [{'born': 1970, 'name': 'Jay Mohr'}],\n",
       " [{'born': 1996, 'name': 'Jonathan Lipnicki'}],\n",
       " [{'born': 1969, 'name': 'Renee Zellweger'}],\n",
       " [{'born': 1962, 'name': 'Kelly Preston'}],\n",
       " [{'born': 1971, 'name': 'Regina King'}],\n",
       " [{'tagline': 'The rest of his life begins now.',\n",
       "   'title': 'Jerry Maguire',\n",
       "   'released': 2000}],\n",
       " [{'born': 1940, 'name': 'James L. Brooks'}],\n",
       " [{'tagline': 'A comedy from the heart that goes for the throat.',\n",
       "   'title': 'As Good as It Gets',\n",
       "   'released': 1997}],\n",
       " [{'born': 1970, 'name': 'River Phoenix'}],\n",
       " [{'born': 1942, 'name': 'Marshall Bell'}],\n",
       " [{'born': 1972, 'name': 'Wil Wheaton'}],\n",
       " [{'born': 1966, 'name': 'John Cusack'}],\n",
       " [{'born': 1971, 'name': 'Corey Feldman'}],\n",
       " [{'tagline': \"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\",\n",
       "   'title': 'Stand By Me',\n",
       "   'released': 1986}],\n",
       " [{'born': 1956, 'name': 'Carrie Fisher'}],\n",
       " [{'born': 1948, 'name': 'Billy Crystal'}],\n",
       " [{'born': 1949, 'name': 'Bruno Kirby'}],\n",
       " [{'tagline': 'Can two friends sleep together and still love each other in the morning?',\n",
       "   'title': 'When Harry Met Sally',\n",
       "   'released': 1998}],\n",
       " [{'born': 1932, 'name': 'Milos Forman'}],\n",
       " [{'tagline': \"If he's crazy, what does that make you?\",\n",
       "   'title': \"One Flew Over the Cuckoo's Nest\",\n",
       "   'released': 1975}],\n",
       " [{'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'born': 1949, 'name': 'Nancy Meyers'}],\n",
       " [{'born': 1946, 'name': 'Diane Keaton'}],\n",
       " [{'title': \"Something's Gotta Give\", 'released': 2003}],\n",
       " [{'born': 1941, 'name': 'Jim Cash'}],\n",
       " [{'born': 1959, 'name': 'Val Kilmer'}],\n",
       " [{'born': 1944, 'name': 'Tony Scott'}],\n",
       " [{'born': 1933, 'name': 'Tom Skerritt'}],\n",
       " [{'born': 1957, 'name': 'Kelly McGillis'}],\n",
       " [{'born': 1962, 'name': 'Anthony Edwards'}],\n",
       " [{'tagline': 'I feel the need, the need for speed.',\n",
       "   'title': 'Top Gun',\n",
       "   'released': 1986}]]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH (bacon:Person {name:\"Kevin Bacon\"})-[*1..4]-(hollywood)\n",
    "RETURN DISTINCT hollywood"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## O menor caminho entre Kevin Bacon e Meg Ryan\n",
    "``` cypher\n",
    "MATCH p=shortestPath(\n",
    "  (bacon:Person {name:\"Kevin Bacon\"})-[*]-(meg:Person {name:\"Meg Ryan\"})\n",
    ")\n",
    "RETURN p\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Kevin Bacon&#x27;}, {&#x27;roles&#x27;: [&#x27;Jack Swigert&#x27;]}, {&#x27;tagline&#x27;: &#x27;Houston, we have a problem.&#x27;, &#x27;title&#x27;: &#x27;Apollo 13&#x27;, &#x27;released&#x27;: 1995}, {&#x27;roles&#x27;: [&#x27;Jim Lovell&#x27;]}, {&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}, {&#x27;roles&#x27;: [&#x27;Sam Baldwin&#x27;]}, {&#x27;tagline&#x27;: &#x27;What if someone you never met, someone you never saw, someone you never knew was the only someone for you?&#x27;, &#x27;title&#x27;: &#x27;Sleepless in Seattle&#x27;, &#x27;released&#x27;: 1993}, {&#x27;roles&#x27;: [&#x27;Annie Reed&#x27;]}, {&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Meg Ryan&#x27;}]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'born': 1958, 'name': 'Kevin Bacon'},\n",
       "   {'roles': ['Jack Swigert']},\n",
       "   {'tagline': 'Houston, we have a problem.',\n",
       "    'title': 'Apollo 13',\n",
       "    'released': 1995},\n",
       "   {'roles': ['Jim Lovell']},\n",
       "   {'born': 1956, 'name': 'Tom Hanks'},\n",
       "   {'roles': ['Sam Baldwin']},\n",
       "   {'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?',\n",
       "    'title': 'Sleepless in Seattle',\n",
       "    'released': 1993},\n",
       "   {'roles': ['Annie Reed']},\n",
       "   {'born': 1961, 'name': 'Meg Ryan'}]]]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "MATCH p=shortestPath(\n",
    "  (bacon:Person {name:\"Kevin Bacon\"})-[*]-(meg:Person {name:\"Meg Ryan\"})\n",
    ")\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "jupyter": {
     "source_hidden": true
    }
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
